In [1]:
import pandas
from tabula import read_pdf

In [19]:
details_df = read_pdf('DetailsPDF.pdf')
actual_df = pandas.read_excel('ActualNotebook.xlsx')

In [20]:
details_df.head()

   Roll Number            Name Subject1 Subject2
0    201601107  Veera Raghavan        A        S
1    201601108    Venkat Raman        B        A
2    201601109         Vindhya        C        B
3    201601110         Vishwak        D        C
4    201601111           Vitul        E        D

In [21]:
actual_df.head()

   Roll Number            Name
0    201601107  Veera Raghavan
1    201601108    Venkat Raman
2    201601109         Vindhya
3    201601110         Vishwak
4    201601111           Vitul